Ruslan-maniak/STM32-HAL/GPIO/GPIO.h
//******************************************************************************
// Имя файла    :  'GPIO.h'
// заголовок    :  Драйвер портов ввода-вывода (F1)
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  25.07.2015
//******************************************************************************

#ifndef __GPIO_H
#define __GPIO_H

#include "stm32F10x.h" 

//==============================================================================
//                  Структуры и типы
//==============================================================================

    // тригер
    typedef enum
    {
        eGpioTriger_RISE  = EXTI_Trigger_Rising,            // от земли к питанию
        eGpioTriger_FALL  = EXTI_Trigger_Falling,           // от питания к земле
        eGpioTriger_ALL   = EXTI_Trigger_Rising_Falling,    // оба варианта
    } eGpioTriger;
       
    // Структура пина
    typedef struct 
    {
        GPIO_TypeDef*       port;       // порт (A..H)
        uint32_t            rcc;        // источник тактирования
        uint8_t             portSource; // портсоурс 
        uint8_t             pin;        // номер пина (0..15)
        GPIOSpeed_TypeDef   speed;      // скорость (LOW, MEDIUM, HIGH)
        GPIOMode_TypeDef    mode;       // режим работы пина
        uint32_t            remap;      // ремап
    } sGpio;
    
    // структура внешнего прерывания
    typedef struct
    {
        sGpio*              gpio;               // пин
        eGpioTriger         triger;             // тригер прерывания
        void                (*function)(void*); // указатель на внешний обработчик
        void                (*object);          // объект использующий прерывание
    } sExtiHandler;

//==============================================================================
//                      Прототипы функций
//==============================================================================

    // инициализация пина
    void GPIOInit (sGpio* gpio);

    // установка на пине единицы
    void GPIOSet (sGpio* gpio);

    // установка на пине нуля
    void GPIOReset (sGpio* gpio);

    // переключение состояния пина
    void GPIOToggle (sGpio* gpio);    
    
    // установка на пине значения 
    void GPIOWrite (uint8_t value, sGpio* gpio);    
    
    // чтение значения входа пина
    uint8_t GPIOReadIn (sGpio* gpio);    
    
    // чтение значения выхода пина
    uint8_t GPIOReadOut (sGpio* gpio);
    
    // конфигурация внешнего прерывания
    void GPIOExtiConfig (uint8_t priority, void (*fuction)(void*), void (*object), sGpio* gpio);
    
    // включение внешнего прерывания
    void GPIOExtiEnable (eGpioTriger triger, sGpio* gpio);
    
    // выключение внешнего прерывания
    void GPIOExtiDisable (sGpio* gpio);
    
#endif //__GPIO_H








